"""Модуль констант для работы с режимами бота"""

MAIN_MENU = 0  # Главное меню
RANDOM = 1  # Режим случайных фактов
QUESTIONS = 2  # Режим работы с GPT
DIALOG = 3  # Режим разговора со звездой
QUIZ = 4  # Режим викторины
TRANSLATE = 5  # Режим переводов
TRAIN = 6  # Режим тренажёра слов английского языка
DJONNY = 31  # Режим разговора с Джони Деппом
DJENIFER = 32  # Режим разговора с Дженифер Лоуренс
ROBERT = 33  # Режим разговора с Робертом Дауни младшим
HLOYA = 34  # Режим разговора с Хлоёй Грейс Морец
PHISICS = 41  # Режим викторины по физике
ART = 42  # Режим викторины по искусству
IT = 43  # Режим викторины по ИТ
LITERATURE = 44  # Режим викторины по литературе
ENGLISH = 51  # Режим перевода с английского языка
FRENCH = 52  # Режим перевода с французского языка
CHINESE = 53  # Режим перевода с китайского языка
ARABIC = 54  # Режим перевода с арабского языка
WORLD = 61  # Режим тренажёра слов английского языка. Еще слово.
TRENAGER = 62  # Режим тренажёра слов английского языка. Тренировка
